#pragma once

/* 网络接入控制(Network Access Control) */
namespace nac
{
namespace tcli
{
/**
 * @brief 业务码
 */
enum class BizCode
{
    /*********************************************************************
     * 客户端请求(`req_`), 取值: 1xxx
     *********************************************************************/
    req_hearbeat = 1001, /* 心跳 */
    req_auth = 1002, /* 鉴权 */
    req_login = 1003, /* 登录 */
    req_logout = 1004, /* 退出 */
    /*********************************************************************
     * 服务端通知(`notify_`), 取值: 2xxx
     *********************************************************************/
    notify_proc_upgrade = 2001, /* 版本升级 */
};
} // namespace tcli
} // namespace nac
